#### Staff Details

In [5]:
import pandas as pd

In [6]:
data = {
    "Name": ["Adewale Johnson", "Blessing Okafor", "Samuel Adebayo", "Grace Oladiwura", "Daniel Ogunleye", "Peace Chukwu", "Ibrahim Sadiq", "Victoria Mensah", "Emmanuel Oladipo", "Ruth Adekunle", "Peter Williams", "Funmi Ajayi", "Micheal Okoye", "Esther Lawal", "Joseph Danjuma", "Deborah Alabi", "Sola Adeyemi", "Mary Nwankwo", "Tunde Balogun", "Aisha Bello", "David Olatunji", "Sarah Peters", "Kingsley Uche", "Halima Yusuf", "Andrew Cole", "Joy Abimbola", "Felix Onyekachi", "Zainab Abdullahi", "Paul Eze",  "Lydia Afolayan" ],
    "Age": [24, 29, 32, 26, 35, 23, 41, 28, 34, 27, 45, 31, 38, 25, 42, 30, 36, 22, 39, 27, 33, 29, 37, 24, 46, 28, 35, 26, 40, 34 ],
    "Salary($)": [60, 85, 130, 70, 155, 55, 210, 100, 140, 80, 250, 115, 185, 65, 225, 105, 160, 50, 200, 80, 135, 95, 175, 60, 280, 90, 150, 70, 205, 145]
}
df = pd.DataFrame(data)
print(df)

                Name  Age  Salary($)
0    Adewale Johnson   24         60
1    Blessing Okafor   29         85
2     Samuel Adebayo   32        130
3    Grace Oladiwura   26         70
4    Daniel Ogunleye   35        155
5       Peace Chukwu   23         55
6      Ibrahim Sadiq   41        210
7    Victoria Mensah   28        100
8   Emmanuel Oladipo   34        140
9      Ruth Adekunle   27         80
10    Peter Williams   45        250
11       Funmi Ajayi   31        115
12     Micheal Okoye   38        185
13      Esther Lawal   25         65
14    Joseph Danjuma   42        225
15     Deborah Alabi   30        105
16      Sola Adeyemi   36        160
17      Mary Nwankwo   22         50
18     Tunde Balogun   39        200
19       Aisha Bello   27         80
20    David Olatunji   33        135
21      Sarah Peters   29         95
22     Kingsley Uche   37        175
23      Halima Yusuf   24         60
24       Andrew Cole   46        280
25      Joy Abimbola   28         90
26   Felix Onyekachi   35        150
27  Zainab Abdullahi   26         70
28          Paul Eze   40        205
29    Lydia Afolayan   34        145

### Viewing data

In [7]:
df.head()
df.tail()
df.shape
df.columns
df.info
df.describe

<bound method NDFrame.describe of                 Name  Age  Salary($)
0    Adewale Johnson   24         60
1    Blessing Okafor   29         85
2     Samuel Adebayo   32        130
3    Grace Oladiwura   26         70
4    Daniel Ogunleye   35        155
5       Peace Chukwu   23         55
6      Ibrahim Sadiq   41        210
7    Victoria Mensah   28        100
8   Emmanuel Oladipo   34        140
9      Ruth Adekunle   27         80
10    Peter Williams   45        250
11       Funmi Ajayi   31        115
12     Micheal Okoye   38        185
13      Esther Lawal   25         65
14    Joseph Danjuma   42        225
15     Deborah Alabi   30        105
16      Sola Adeyemi   36        160
17      Mary Nwankwo   22         50
18     Tunde Balogun   39        200
19       Aisha Bello   27         80
20    David Olatunji   33        135
21      Sarah Peters   29         95
22     Kingsley Uche   37        175
23      Halima Yusuf   24         60
24       Andrew Cole   46        280
25      Joy Abimbola   28         90
26   Felix Onyekachi   35        150
27  Zainab Abdullahi   26         70
28          Paul Eze   40        205
29    Lydia Afolayan   34        145>

In [8]:
print(df.loc[0, "Name"])
print(df.iloc[2, 1])

print(df.loc[25, "Age"])

Adewale Johnson
32
28

### Filtering data

In [9]:
print(df)

                Name  Age  Salary($)
0    Adewale Johnson   24         60
1    Blessing Okafor   29         85
2     Samuel Adebayo   32        130
3    Grace Oladiwura   26         70
4    Daniel Ogunleye   35        155
5       Peace Chukwu   23         55
6      Ibrahim Sadiq   41        210
7    Victoria Mensah   28        100
8   Emmanuel Oladipo   34        140
9      Ruth Adekunle   27         80
10    Peter Williams   45        250
11       Funmi Ajayi   31        115
12     Micheal Okoye   38        185
13      Esther Lawal   25         65
14    Joseph Danjuma   42        225
15     Deborah Alabi   30        105
16      Sola Adeyemi   36        160
17      Mary Nwankwo   22         50
18     Tunde Balogun   39        200
19       Aisha Bello   27         80
20    David Olatunji   33        135
21      Sarah Peters   29         95
22     Kingsley Uche   37        175
23      Halima Yusuf   24         60
24       Andrew Cole   46        280
25      Joy Abimbola   28         90
26   Felix Onyekachi   35        150
27  Zainab Abdullahi   26         70
28          Paul Eze   40        205
29    Lydia Afolayan   34        145

In [10]:
print(df["Name"])

0      Adewale Johnson
1      Blessing Okafor
2       Samuel Adebayo
3      Grace Oladiwura
4      Daniel Ogunleye
5         Peace Chukwu
6        Ibrahim Sadiq
7      Victoria Mensah
8     Emmanuel Oladipo
9        Ruth Adekunle
10      Peter Williams
11         Funmi Ajayi
12       Micheal Okoye
13        Esther Lawal
14      Joseph Danjuma
15       Deborah Alabi
16        Sola Adeyemi
17        Mary Nwankwo
18       Tunde Balogun
19         Aisha Bello
20      David Olatunji
21        Sarah Peters
22       Kingsley Uche
23        Halima Yusuf
24         Andrew Cole
25        Joy Abimbola
26     Felix Onyekachi
27    Zainab Abdullahi
28            Paul Eze
29      Lydia Afolayan
Name: Name, dtype: object

In [11]:
print(df["Age"]  > 30)

0     False
1     False
2      True
3     False
4      True
5     False
6      True
7     False
8      True
9     False
10     True
11     True
12     True
13    False
14     True
15    False
16     True
17    False
18     True
19    False
20     True
21    False
22     True
23    False
24     True
25    False
26     True
27    False
28     True
29     True
Name: Age, dtype: bool

In [12]:
print(df["Age"]  < 40)

0      True
1      True
2      True
3      True
4      True
5      True
6     False
7      True
8      True
9      True
10    False
11     True
12     True
13     True
14    False
15     True
16     True
17     True
18     True
19     True
20     True
21     True
22     True
23     True
24    False
25     True
26     True
27     True
28    False
29     True
Name: Age, dtype: bool

In [13]:
print(df["Age"]  > 10)

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
12    True
13    True
14    True
15    True
16    True
17    True
18    True
19    True
20    True
21    True
22    True
23    True
24    True
25    True
26    True
27    True
28    True
29    True
Name: Age, dtype: bool

In [14]:
df[(df["Age"]  >= 25)  & (df["Age"]  <= 35)]

                Name  Age  Salary($)
1    Blessing Okafor   29         85
2     Samuel Adebayo   32        130
3    Grace Oladiwura   26         70
4    Daniel Ogunleye   35        155
7    Victoria Mensah   28        100
8   Emmanuel Oladipo   34        140
9      Ruth Adekunle   27         80
11       Funmi Ajayi   31        115
13      Esther Lawal   25         65
15     Deborah Alabi   30        105
19       Aisha Bello   27         80
20    David Olatunji   33        135
21      Sarah Peters   29         95
25      Joy Abimbola   28         90
26   Felix Onyekachi   35        150
27  Zainab Abdullahi   26         70
29    Lydia Afolayan   34        145

In [15]:
df[df["Salary($)"] > 150]

               Name  Age  Salary($)
4   Daniel Ogunleye   35        155
6     Ibrahim Sadiq   41        210
10   Peter Williams   45        250
12    Micheal Okoye   38        185
14   Joseph Danjuma   42        225
16     Sola Adeyemi   36        160
18    Tunde Balogun   39        200
22    Kingsley Uche   37        175
24      Andrew Cole   46        280
28         Paul Eze   40        205

In [16]:
df[(df["Salary($)"]  >= 80) & (df["Salary($)"] <= 200)]

                Name  Age  Salary($)
1    Blessing Okafor   29         85
2     Samuel Adebayo   32        130
4    Daniel Ogunleye   35        155
7    Victoria Mensah   28        100
8   Emmanuel Oladipo   34        140
9      Ruth Adekunle   27         80
11       Funmi Ajayi   31        115
12     Micheal Okoye   38        185
15     Deborah Alabi   30        105
16      Sola Adeyemi   36        160
18     Tunde Balogun   39        200
19       Aisha Bello   27         80
20    David Olatunji   33        135
21      Sarah Peters   29         95
22     Kingsley Uche   37        175
25      Joy Abimbola   28         90
26   Felix Onyekachi   35        150
29    Lydia Afolayan   34        145

In [17]:
df[(df["Age"] < 25)| (df["Salary($)"] < 80)]

                Name  Age  Salary($)
0    Adewale Johnson   24         60
3    Grace Oladiwura   26         70
5       Peace Chukwu   23         55
13      Esther Lawal   25         65
17      Mary Nwankwo   22         50
23      Halima Yusuf   24         60
27  Zainab Abdullahi   26         70

In [29]:
print(df["Age"]. min()) 
print(df["Age"]. max())
print(df[df["Age"] == 22])
print((df["Salary($)"]. min()))
print(df[df["Salary($)"] <= 50])
print(df[df["Age"] == 46])
print(df[df["Salary($)"] ==280])

22
46
            Name  Age  Salary($)
17  Mary Nwankwo   22         50
50
            Name  Age  Salary($)
17  Mary Nwankwo   22         50
           Name  Age  Salary($)
24  Andrew Cole   46        280
           Name  Age  Salary($)
24  Andrew Cole   46        280